IDENTIFICATION DIVISION.
PROGRAM-ID. ProgrammName.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
LINKAGE SECTION.

PROCEDURE DIVISION.
CALL 'GETSUM' USING Num1 Num2 Num3.

