IDENTIFICATION DIVISION.
PROGRAM-ID. ProgrammName2.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
COPY Procedurebook.
LINKAGE SECTION.

PROCEDURE DIVISION.

