IDENTIFICATION DIVISION.
PROGRAM-ID. ProgrammName.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT InputFile ASSIGN TO 'input.txt'.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

LINKAGE SECTION.

PROCEDURE DIVISION.
