IDENTIFICATION DIVISION.
PROGRAM-ID. Paragraphen.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
LINKAGE SECTION.

PROCEDURE DIVISION.
PARA-1.
  DISPLAY "Hier passiert was".
  PARA-2.


PARA-2.
  DISPLAY "Hier passiert auch was".
  STOP RUN.

