IDENTIFICATION DIVISION.
PROGRAM-ID. ProgrammName.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
COPY WS-BOOK.
LINKAGE SECTION.

PROCEDURE DIVISION.
PARA-2.
    DISPLAY "Hello, world!".
    COPY PROCEDURE-BOOK.
    DISPLAY "Hello, world!".

PARAGRAPH-1.
    COPY PROCEDURE-BOOK.
    DISPLAY "Hello, world!".
    PARA-2.

STOP RUN.