IDENTIFICATION DIVISION. 
PROGRAM-ID. BeispielProgramm.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-Zahl1 PIC 9.

PROCEDURE DIVISION.
CALL 'SubProgram' USING WS-Zahl1.