IDENTIFICATION DIVISION. 
PROGRAM-ID. BeispielProgramm.
DATA DIVISION.
WORKING-STORAGE SECTION.

procedure division.
BeispielParagraph.
    DISPLAY "Hello, world!".

GO TO BeispielParagraph.
GO TO BeispielParagraph.