IDENTIFICATION DIVISION.
PROGRAM-ID. BeispielProgramm.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 Zahl1 PIC 9.
01 Zahl2 PIC 9.
01 Zahl3 PIC 9.
01 Zahl4 PIC 9.
01 Ergebnis PIC 99.
PROCEDURE DIVISION.
IF Zahl1
       ADD Zahl1 TO Zahl1 GIVING Ergebnis
        ADD 1 TO Zahl2 GIVING Ergebnis
        ADD Zahl3 TO Zahl3
        ADD 3 TO Zahl4
END-IF.
