IDENTIFICATION DIVISION.
PROGRAM-ID. BeispielProgramm.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 Zahl1 PIC 9.

PROCEDURE DIVISION.
IF Zahl1
  MOVE 1 TO Zahl1
END-IF.
