IDENTIFICATION DIVISION.
PROGRAM-ID. BeispielProgramm.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 Zahl1 PIC 9.
PROCEDURE DIVISION.

MOVE 1 TO Zahl1.
Move 2 TO Zahl1.