IDENTIFICATION DIVISION. 
PROGRAM-ID. BeispielProgramm.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-Zahl1 PIC 9.
PROCEDURE DIVISION.
SET WS-Zahl1 TO 10.
SET WS-Zahl1 TO 10.
