IDENTIFICATION DIVISION. 
PROGRAM-ID. BeispielProgramm.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-Zahl1 PIC 9.
01 WS-Zahl2 PIC 9.
01 WS-Zahl3 PIC 9.
01 WS-Zahl4 PIC 9.
01 WS-Ergebnis PIC 9.
procedure division.
SUBTRACT WS-Zahl1 FROM WS-Zahl2.
SUBTRACT WS-Zahl3 FROM WS-Zahl4 GIVING WS-Ergebnis.